---
kind: property
id: P:Autodesk.Revit.DB.Connector.EngagementLength
zh: 连接件、接口
source: html/77925d0a-0c74-aeaa-0727-950d54f95d75.htm
---
# Autodesk.Revit.DB.Connector.EngagementLength Property

**中文**: 连接件、接口

Connector engagement length. When applicable, it represents the inset distance to the end of the fabrication part from the connection point. Otherwise it returns zero.

## Syntax (C#)
```csharp
public double EngagementLength { get; }
```